import unittest

from AI.ai_adapters.basic_algorithm_adapter import BasicAlgorithmAdapter


class TestBasicAlgorithmAdapter(unittest.TestCase):
    def setUp(self):
        self.adapter = BasicAlgorithmAdapter()

    def test_referenceToAnalyze(self):
        text: [str] = [
            "כשאני חושב על החיים שלי, אני מרגיש שאין לי סיבה להמשיך. כל הדברים הטובים בחיי הם זכרונות ישנים, וכל מה שיש לי עכשיו הוא כאב ועצב. אני מרגיש שאין לי תקווה ואין לי עתיד. זה כאילו אני צועק בתוך הריקנות ואין אף אחד ששומע אותי. אני לא רואה את המשמעות בהמשך החיים ואיך אני יכול לחזור אחרי כך שאני מרגיש עכשיו.",
            "החיים כל כך מאתגרים ומתישים לי בעודם ממשיכים באופן לא רצוי. כל יום הוא קרב חדש, ואני מרגיש שאין לי מקום לנשום. הלחץ היומיומי כל כך גבוה ואין סוף לעומס התורנות על כתפיי. אני מתעייף מהאובדן שאני מרגיש כל יום ומתקשה לראות עתיד. התחושה שאני תקוע במקום ואין לי אפשרות לצאת ממנו מחדירה לי חוסר אוויר וחוסר מנוחה. לפעמים אני מתמודד עם הכל ומרגיש שאני לבד בעולם זר.",
            "כל יום עובר ואני מרגיש כמו שהחיים רק מקשים עליי. אין לי שום כישורים או יכולת להתמודד עם הקשיים של החיים. אני נמצא במקום כהה ואין לי כוח לצאת ממנו. אני רואה רק קירות סביבי ואין לי מקום להיפרד. אני מרגיש שאין לי ברירה אלא להפסיק לקיום את החיים האלה.",
        ]

        result = self.adapter.reference_to_analyze_test(text)
        self.assertTrue(result[0][1] > 0.8)
        self.assertTrue(result[1][1] < 0.5)
        self.assertTrue(result[2][1] > 0.8)


if __name__ == "__main__":
    unittest.main()
